# Brewfile - Personal tools
# Install with: brew bundle --file=Brewfile

# =============================================================================
# Taps
# =============================================================================
tap "felixkratz/formulae"      # sketchybar, borders
tap "nikitabobko/tap"          # aerospace
tap "fgeck/tap"                # personal tap
tap "sdkman/tap"               # Java SDK manager
tap "aquasecurity/trivy"       # security scanner
tap "fluxcd/tap"               # GitOps
tap "jesseduffield/lazygit"    # lazygit

# =============================================================================
# Shell & Terminal
# =============================================================================
brew "bat"                     # better cat
brew "eza"                     # better ls
brew "fd"                      # better find
brew "fzf"                     # fuzzy finder
brew "fzf-tab"                 # fzf tab completion
brew "starship"                # prompt
brew "zoxide"                  # better cd
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "thefuck"                 # command correction
brew "tldr"                    # simplified man pages
brew "neofetch"                # system info
brew "tree"                    # directory tree
brew "htop"                    # process viewer
brew "ranger"                  # file manager
brew "yazi"                    # file manager

# =============================================================================
# Editors
# =============================================================================
brew "neovim"
brew "vim"

# =============================================================================
# Git & Version Control
# =============================================================================
brew "gh"                      # GitHub CLI
brew "git-delta"               # better git diff
brew "git-filter-repo"         # git history rewriting
brew "gitleaks"                # secret scanning
brew "lazygit"                 # git TUI

# =============================================================================
# Containers & Kubernetes
# =============================================================================
brew "cilium-cli"
brew "fluxcd/tap/flux"
brew "helmfile"
brew "k9s"                     # k8s TUI
brew "krew"                    # kubectl plugin manager
brew "kubectx"                 # k8s context switcher
brew "kustomize"
brew "talosctl"
brew "podman-compose"

# =============================================================================
# Cloud & Infrastructure
# =============================================================================
brew "awscli"
brew "sops"                    # secrets management
brew "age"                     # encryption
brew "rclone"                  # cloud storage sync
brew "restic"                  # backup

# =============================================================================
# Dev Tools - Go
# =============================================================================
brew "golangci-lint"
brew "goreleaser"
brew "mockery"
brew "sqlc"

# =============================================================================
# Dev Tools - Java
# =============================================================================
brew "gradle"
brew "maven"
brew "sdkman/tap/sdkman-cli"

# =============================================================================
# Dev Tools - Python
# =============================================================================
brew "pipx"
brew "pdm"
brew "pyenv"
brew "uv"

# =============================================================================
# Dev Tools - JS/Other
# =============================================================================
brew "nvm"
brew "deno"
brew "tailwindcss"

# =============================================================================
# Dev Tools - General
# =============================================================================
brew "golang-migrate"
brew "go-task"
brew "luarocks"                # lua package manager (for neovim)

# =============================================================================
# Security & Network
# =============================================================================
brew "aquasecurity/trivy/trivy"
brew "gobuster"
brew "katana"
brew "nmap"
brew "mtr"
brew "arping"
brew "wireguard-tools"

# =============================================================================
# Media & Documents
# =============================================================================
brew "imagemagick"
brew "poppler"                 # PDF tools
brew "resvg"                   # SVG rendering
brew "glow"                    # markdown viewer
brew "vhs"                     # terminal recorder

# =============================================================================
# Utilities
# =============================================================================
brew "coreutils"
brew "gnu-sed"
brew "jq"
brew "yq"
brew "sevenzip"
brew "stow"
brew "watch"
brew "wget"
brew "switchaudio-osx"
brew "wakeonlan"
brew "bitwarden-cli"
brew "gum"                     # shell script helpers
brew "snitch"
brew "gemini-cli"

# =============================================================================
# macOS Window Management & Status Bar
# =============================================================================
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# =============================================================================
# Casks - Terminal & Editors
# =============================================================================
cask "ghostty"
cask "iterm2"
cask "visual-studio-code"
cask "zed"
cask "intellij-idea"

# =============================================================================
# Casks - Browsers
# =============================================================================
cask "firefox"
cask "google-chrome"
cask "librewolf"
cask "helium-browser"

# =============================================================================
# Casks - Containers
# =============================================================================
cask "docker-desktop"
cask "podman-desktop"

# =============================================================================
# Casks - Productivity
# =============================================================================
cask "obsidian"
cask "raycast"
cask "alt-tab"
cask "itsycal"
cask "shottr"                  # screenshots
cask "pearcleaner"             # app uninstaller
cask "stats"                   # system stats
cask "drawio"
cask "pencil"

# =============================================================================
# Casks - Communication
# =============================================================================
cask "slack"
cask "signal"
cask "telegram"

# =============================================================================
# Casks - Fonts
# =============================================================================
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"

# =============================================================================
# Casks - Security
# =============================================================================
cask "bitwarden"
cask "mitmproxy"

# =============================================================================
# Casks - Media
# =============================================================================
cask "vlc"
cask "moonlight"

# =============================================================================
# Casks - Utilities
# =============================================================================
cask "utm"                     # virtual machines
cask "raspberry-pi-imager"
cask "kicad"                   # PCB design
cask "orcaslicer"              # 3D printing
cask "sf-symbols"
cask "us-with-german-umlauts"

# =============================================================================
# Casks - AI & Coding
# =============================================================================
cask "claude-code"
cask "codex"

# =============================================================================
# Casks - Dev Tools
# =============================================================================
cask "bruno"                   # API testing
cask "visualvm"                # Java profiling

