# Brewfile - Personal tools
# Install with: brew bundle --file=Brewfile
#
# Post-install steps:
#   1. Install Java 21 via SDKMAN:  sdk install java 21-tem
#   2. Install Node via NVM:        nvm install --lts

# =============================================================================
# Taps
# =============================================================================
tap "aquasecurity/trivy"       # security scanner
tap "felixkratz/formulae"      # sketchybar, borders
tap "fgeck/tap"                # personal tap
tap "fluxcd/tap"               # GitOps
tap "jesseduffield/lazygit"    # lazygit
tap "nikitabobko/tap"          # aerospace
tap "sdkman/tap"               # Java SDK manager

# =============================================================================
# Shell & Terminal
# =============================================================================
brew "bat"                     # better cat
brew "eza"                     # better ls
brew "fd"                      # better find
brew "fzf"                     # fuzzy finder
brew "btop"                    # resource monitor
brew "starship"                # prompt
brew "thefuck"                 # command correction
brew "tldr"                    # simplified man pages
brew "tree"                    # directory tree
brew "yazi"                    # file manager
brew "zoxide"                  # better cd
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"
cask "iterm2"
cask "itermai"

# =============================================================================
# Editors & IDEs
# =============================================================================
brew "neovim"
cask "intellij-idea"
cask "visual-studio-code"
cask "zed"

# =============================================================================
# Git & Version Control
# =============================================================================
brew "gh"                      # GitHub CLI
brew "git-delta"               # better git diff
brew "git-filter-repo"         # git history rewriting
brew "gitleaks"                # secret scanning
brew "lazygit"                 # git TUI

# =============================================================================
# Containers & Kubernetes
# =============================================================================
brew "cilium-cli"
brew "fluxcd/tap/flux"
brew "helmfile"
brew "k9s"                     # k8s TUI
brew "krew"                    # kubectl plugin manager
brew "kubectx"                 # k8s context switcher
brew "kustomize"
brew "podman-compose"
cask "docker-desktop"
cask "podman-desktop"

# =============================================================================
# Cloud & Infrastructure
# =============================================================================
brew "talosctl"
brew "age"                     # encryption
brew "awscli"
brew "rclone"                  # cloud storage sync
brew "restic"                  # backup
brew "sops"                    # secrets management

# =============================================================================
# Dev Tools - Go
# =============================================================================
brew "go"                      # Go language
brew "go-task"                 # task runner
brew "golang-migrate"          # database migrations
brew "golangci-lint"           # linter
brew "goreleaser"              # release automation
brew "mockery"                 # mock generator
brew "sqlc"                    # SQL code generator

# =============================================================================
# Dev Tools - Java
# =============================================================================
# After brew bundle, run: sdk install java 21-tem
brew "gradle"                  # build tool
brew "maven"                   # build tool
brew "sdkman/tap/sdkman-cli"   # Java version manager
cask "visualvm"                # Java profiling

# =============================================================================
# Dev Tools - Python
# =============================================================================
brew "pdm"
brew "pipx"
brew "pyenv"
brew "uv"

# =============================================================================
# Dev Tools - JavaScript/Node
# =============================================================================
# After brew bundle, run: nvm install --lts
brew "deno"
brew "oven-sh/bun/bun"
brew "nvm"                     # Node version manager
brew "tailwindcss"

# =============================================================================
# Dev Tools - Other
# =============================================================================
brew "luarocks"                # lua package manager (for neovim)
brew "rust"

# =============================================================================
# AI & Coding Assistants
# =============================================================================
brew "gemini-cli"
brew "anomalyco/tap/opencode"
cask "claude-code"

# =============================================================================
# Security & Network
# =============================================================================
brew "arping"
brew "gobuster"
brew "mtr"
brew "nmap"
brew "wireguard-tools"
cask "bitwarden"
cask "mitmproxy"

# =============================================================================
# Browsers
# =============================================================================
cask "firefox"
cask "google-chrome"
cask "helium-browser"
cask "librewolf"

# =============================================================================
# Communication
# =============================================================================
cask "signal"
cask "slack"
cask "telegram"

# =============================================================================
# Media & Documents
# =============================================================================
brew "glow"                    # markdown viewer
brew "resvg"                   # SVG rendering
brew "vhs"                     # terminal recorder
cask "moonlight"               # game streaming
cask "vlc"

# =============================================================================
# Productivity
# =============================================================================
cask "drawio"
cask "obsidian"
cask "shottr"                  # screenshots
cask "pearcleaner"             # app uninstaller
brew "via"                     # QMK Keyboard Configurator
cask "homerow"                 # HomeRowMods App
cask "mindwtr"                 # GTD App
brew "west"                    # Zephyr RTOS build system
brew "hidapi"                  # for custom keyboard firmware development
cask "handy"                   # FOSS speech to text

# =============================================================================
# macOS Window Management & Status Bar
# =============================================================================
cask "raycast"
cask "nikitabobko/tap/aerospace"
brew "flashspace"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "alt-tab"
cask "itsycal"
brew "kanata"                  # keyboard remapper
brew "asmvik/formulae/skhd"    # hotkey daemon
cask "stats"                   # system stats

# =============================================================================
# Utilities
# =============================================================================
brew "bitwarden-cli"
brew "coreutils"
brew "gnu-sed"
brew "gum"                     # shell script helpers
brew "jq"
brew "sevenzip"
brew "snitch"
brew "stow"
brew "switchaudio-osx"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "yq"
cask "raspberry-pi-imager"
cask "sf-symbols"
cask "us-with-german-umlauts"
cask "utm"                     # virtual machines

# =============================================================================
# Hardware & Making
# =============================================================================
# cask "kicad"                   # PCB design
cask "orcaslicer"              # 3D printing
# cask "autodesk-fusion"         # 3D modeling

# =============================================================================
# Fonts
# =============================================================================
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
